# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, DWSConv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, DWSConv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2_DWSConv, [256, False, 0.25]]

  - [-1, 1, DWSConv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2_DWSConv, [512, False, 0.25]]

  - [-1, 1, DWSConv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2_DWSConv, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  - [ 2, 1, Conv,[ 256, 1, 1]]  #L1 9-p3/16 通道维持
  - [ 4, 1, Conv,[ 512, 1, 1 ]]  #L2 10-p4/16
  - [ 8, 1, Conv,[ 1024, 1, 1]] #L3 11-p5/32

  - [ 10, 1, ResUpDownSample, [ 256,"up" ] ]#L1 12
  - [ [ 9,12 ], 1, FeatureFusion,[ [ 256,256 ],"asff2" ] ]#L1 13

  - [ 9, 1, ResUpDownSample, [ 512,"down" ] ]#L2 14
  - [ [ 10,14 ], 1, FeatureFusion,[ [ 512,512 ],"asff2" ] ]#L2 15
  - [ 8, 1, ResUpDownSample, [ 512,"up" ] ] #L2  16
  - [ [ 16,15 ], 1, ACBiFPN,[ 512,2 ] ] #L2 17

  - [ 17, 1, ResUpDownSample,[ 256,"up" ] ] #L1 18
  - [ [ -1,13 ], 1, ACBiFPN, [ 256,2 ] ] #L1 19
  - [ -1, 2, C3k2_DWSConv, [ 256, False ] ] #L1 20

  - [ 17, 2, C3k2_DWSConv, [ 512, False ] ] #L2 21

  - [ 21, 1, ResUpDownSample,[ 256,"up" ] ] #L1 22
  - [ [ 22,20 ], 1, FeatureFusion,[ [ 256,256 ],"asff2" ] ] #L1 23

  - [ 20, 1, ResUpDownSample, [ 512,"down" ] ] #L2 24
  - [ 11, 1, ResUpDownSample, [ 512,"up" ] ] #L2 25
  - [ [ 21,24,25 ], 1 ,FeatureFusion, [ [ 512,512 ],"asff3" ] ] #L2 26

  - [ 21, 1, ResUpDownSample, [ 1024,"down" ] ] #L3 27
  - [ [ 11,27 ], 1, FeatureFusion,[ [ 1024,1024 ],"asff2" ] ] #L3 28
  - [ 28, 2, C3k2_DWSConv, [ 1024, False ] ] #L3 29 end

  - [ 28, 1, ResUpDownSample, [ 512,"up" ] ] #L2 30
  - [ [ 26,30 ], 1, ACBiFPN,[ 512,2 ] ] #L2 31
  - [ 28, 2, C3k2_DWSConv, [ 512, False ] ] #L2 32

  - [ 31, 1, ResUpDownSample, [ 256,"up" ] ] #L1 33
  - [ [ 23,33 ], 1, ACBiFPN,[ 256,2 ] ] #L1 34
  - [ 34, 2, C3k2_DWSConv, [ 256, False ] ] #L1 35

  # ----------------- 检测头连接 -----------------
  - [ [ 35, 32, 29 ], 1, Detect, [ nc ] ] # 对应P3/8, P4/16, P5/32
